'''a = int(input("请输入一个四位整数："))
if a<=9999 and a>=1000:
    q = a//1000
    b = (a//100)-q*10
    s = (a//10)-b*10-q*100
    g = a-q*1000-b*100-s*10

    g = a//1%10
    s = a//10%10
    b = a//100%10
    q = a//1000

    a = str(a)
    g = a[3];s = a[2];b = a[1];q = a[0]

    print(f"""千位：{q}
    百位：{b}
    十位：{s}
    个位：{g}""")
else:
    print("你输的什么玩意？")

'''


'''def EnLevel(n):
    # 请在这里编写程序，完成本关任务
    #   请在此添加实现代码   #
    # ********** Begin *********#

    m = 9.1094 * 10 ** (-31)
    e = 1.6022 * 10 ** (-19)
    s = 8.8542 * 10 ** (-12)
    h = 6.6261 * 10 ** (-34)
    E = -(m * e ** 4) / (8 * (s ** 2) * (h ** 2) * n ** 2)
    E = round(E, 5)
    print(E)
    return (E)
level = int(input())
EnLevel(level)'''


a = round(-2.234324,5)
print(a)
























